DataGeneration/squared_cylinder_point/original/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                |                                                  |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox            |
|  \    /   O peration     | Version:  5                                      |
|   \  /    A nd           | Web:      www.OpenFOAM.org                       |
|    \/     M anipulation  |                                                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
   version     2.0;
   format      ascii;
   class       dictionary;
   object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 -0.05)
    (1.0 0 -0.05)
    (0 0.2 -0.05)
    (1.0 0.2 -0.05)
    (1.5 0.2 -0.05)
    (0 0.5 -0.05)
    (1.0 0.5 -0.05)
    (1.5 0.5 -0.05)
    (0 0 0.05)
    (1.0 0 0.05)
    (0 0.2 0.05)
    (1.0 0.2 0.05)
    (1.5 0.2 0.05)
    (0 0.5 0.05)
    (1.0 0.5 0.05)
    (1.5 0.5 0.05)
    (5 0.2 -0.05)
    (5 0.5 -0.05)
    (1.5 0 -0.05)
    (5 0 -0.05)
    (5 0.2 0.05)
    (5 0.5 0.05)
    (1.5 0 0.05)
    (5 0 0.05)
);

blocks
(
    hex (0 1 3 2 8 9 11 10) (50 10 1) simpleGrading (1 1 1)
    hex (2 3 6 5 10 11 14 13) (50 15 1) simpleGrading (1 1 1)
    hex (3 4 7 6 11 12 15 14) (25 15 1) simpleGrading (1 1 1)
    hex (4 16 17 7 12 20 21 15) (175 15 1) simpleGrading (1 1 1)
    hex (18 19 16 4 22 23 20 12) (175 10 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 8 10 2)
            (2 10 13 5)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (19 16 20 23)
		 (16 17 21 20)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (18 19 23 22)
        );
    }
    top
    {
        type wall;
        faces
        (
            (5 13 14 6)
            (6 14 15 7)
            (17 7 15 21)
        );
    }
    obstacle
    {
        type wall;
        faces
        (
            (1 3 11 9)
            (3 4 12 11)
            (4 18 22 12)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
