DataGeneration/squared_cylinder_point/original/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    obstacle
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    top
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;

    }

/*
    top
    {
	type fixedValue;
	value $internalField;
    }
*/

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
